---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyMultipleSketchParents
source: html/926979e2-bca0-3e83-fe77-f7d4aae5fa41.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyMultipleSketchParents Property

Copying elements from unrelated Workplanes together is not supported in families. Try copying elements separately.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyMultipleSketchParents { get; }
```